# Задача 1. Даны две независимые выборки. Не соблюдается условие нормальности
# x1 380,420, 290
# y1 140,360,200,900
# Сделайте вывод по результатам, полученным с помощью функции, имеются ли статистические различия между группами?

# Задача 2. Исследовалось влияние препарата на уровень давления пациентов. Сначала
# измерялось давление до приема препарата, потом через 10 минут и через 30 минут. Есть
# ли статистически значимые различия между измерениями давления? В выборках не соблюдается условие нормальности.
# 1е измерение до приема препарата: 150, 160, 165, 145, 155
# 2е измерение через 10 минут: 140, 155, 150, 130, 135
# 3е измерение через 30 минут: 130, 130, 120, 130, 125

# Задача 3. Сравните 1 и 2 е измерения, предполагая, что 3го измерения через 30 минут не было. Есть
# ли статистически значимые различия между измерениями давления?

# Задача 4. Даны 3 группы учеников плавания. Не соблюдается условие нормальности.
# В 1 группе время на дистанцию 50 м составляют:
# 56, 60, 62, 55, 71, 67, 59, 58, 64, 67
# Вторая группа : 57, 58, 69, 48, 72, 70, 68, 71, 50, 53
# Третья группа: 57, 67, 49, 48, 47, 55, 66, 51, 54
# Есть ли статистически значимые различия между группами?

# Задача 5. Заявляется, что партия изготавливается со средним арифметическим 2,5 см. Проверить
# данную гипотезу, если известно, что размеры изделий подчинены нормальному закону
# распределения. Объем выборки 10, уровень статистической значимости 5%
# 2.51, 2.35, 2.74, 2.56, 2.40, 2.36, 2.65, 2.7, 2.67, 2.34


from scipy.stats import mannwhitneyu
from scipy.stats import friedmanchisquare

#1
print ('Задача 1')
x1 = [380, 420, 290]
y1 = [140, 360, 200, 900]

stat, p = mannwhitneyu(x1, y1)
print('Statistics=%.3f, p=%.3f' % (stat, p))

alpha = 0.05
if p > alpha:
    print('Нет статистически значимых различий между группами')
else:
    print('Есть статистически значимые различия между группами')


#2
print ('\nЗадача 2')
x1 = [150, 160, 165, 145, 155]
x2 = [140, 155, 150, 130, 135]
x3 = [130, 130, 120, 130, 125]

stat, p = friedmanchisquare(x1, x2, x3)
print('Statistics=%.3f, p=%.3f' % (stat, p))

alpha = 0.05
if p > alpha:
    print('Нет статистически значимых различий между измерениями давления')
else:
    print('Есть статистически значимые различия между измерениями давления')



#3
print ('\nЗадача 3')

x1 = [150, 160, 165, 145, 155]
x2 = [140, 155, 150, 130, 135]

stat, p = mannwhitneyu(x1, x2)
print('Statistics=%.3f, p=%.3f' % (stat, p))

alpha = 0.05
if p > alpha:
    print('Нет статистически значимых различий между измерениями давления')
else:
    print('Есть статистически значимые различия между измерениями давления')


#4
print ('\nЗадача 4')
from scipy.stats import kruskal

group1 = [56, 60, 62, 55, 71, 67, 59, 58, 64, 67]
group2 = [57, 58, 69, 48, 72, 70, 68, 71, 50, 53]
group3 = [57, 67, 49, 48, 47, 55, 66, 51, 54]

stat, p = kruskal(group1, group2, group3)
print('Statistics=%.3f, p=%.3f' % (stat, p))

alpha = 0.05
if p > alpha:
    print('Нет статистически значимых различий между группами')
else:
    print('Есть статистически значимые различия между группами')

#5
print ('\nЗадача 5')
from scipy.stats import ttest_1samp

data = [2.51, 2.35, 2.74, 2.56, 2.40, 2.36, 2.65, 2.7, 2.67, 2.34]
mean_hypothesis = 2.5

stat, p = ttest_1samp(data, mean_hypothesis)
print('Statistics=%.3f, p=%.3f' % (stat, p))

alpha = 0.05
if p > alpha:
    print('Нет статистически значимых различий между средним арифметическим и гипотезой')
else:
    print('Есть статистически значимые различия между средним арифметическим и гипотезой')